{- ************************************************************************** -}
{-                                                                            -}
{-                                                        :::      ::::::::   -}
{-   peano_rus.agda                                     :+:      :+:    :+:   -}
{-                                                    +:+ +:+         +:+     -}
{-   By: wzei <wzei@student.42.fr>                  +#+  +:+       +#+        -}
{-                                                +#+#+#+#+#+   +#+           -}
{-   Created: 2020/01/21 16:24:30 by wzei              #+#    #+#             -}
{-   Updated: 2020/01/21 16:24:32 by wzei             ###   ########.fr       -}
{-                                                                            -}
{- ************************************************************************** -}

module peano_rus where

data ℕ : Set where
    нуль : ℕ
    след : ℕ → ℕ

_+_ : ℕ → ℕ → ℕ
нуль + нуль = нуль
нуль + n    = n
(след n) + n′ = след (n + n′)  -- use \' to input ′.


data _четное : ℕ → Set where
    НУЛЬ_БАЗА : нуль четное
    ШАГ : ∀ x → x четное → след (след x) четное

-- \_1 to type ₁
доказательство₁ : след (след (след (след нуль))) четное
доказательство₁ = ШАГ (след (след нуль)) (ШАГ нуль НУЛЬ_БАЗА)
